Revit 2027 API
AnalysisDisplayDiagramSettings.TextLabelType Property
 Type of diagram text label visualization.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayStyleDiagramTextLabelType TextLabelType { get; set; }
Public Property TextLabelType As AnalysisDisplayStyleDiagramTextLabelType
	Get
	Set
public:
property AnalysisDisplayStyleDiagramTextLabelType TextLabelType {
	AnalysisDisplayStyleDiagramTextLabelType get ();
	void set (AnalysisDisplayStyleDiagramTextLabelType value);
}
member TextLabelType : AnalysisDisplayStyleDiagramTextLabelType with get, set
Property Value
AnalysisDisplayStyleDiagramTextLabelType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalysisDisplayDiagramSettings Class
Autodesk.Revit.DB.Analysis Namespace